  [{
    "sentence": "I once got lost in a foreign city and had to ask for directions using a map made of napkins.",
    "translation": "Jednou jsem se ztratil(a) ve cizím městě a musel(a) jsem se zeptat na cestu pomocí mapy z ubrousků."
  },
  {
    "sentence": "During a road trip, I accidentally left my passport at a gas station and didn't realize it until hours later.",
    "translation": "Během cestování autem jsem omylem zapomněl(a) svůj pas na čerpací stanici a uvědomil(a) jsem si to až po několika hodinách."
  },
  {
    "sentence": "In a foreign country, I tried a local delicacy thinking it was a dessert, but it turned out to be a spicy dish.",
    "translation": "Ve cizí zemi jsem ochutnal(a) místní lahůdku, myslel(a) jsem si, že je to dezert, ale ukázalo se, že je to pikantní jídlo."
  },
  {
    "sentence": "I once went camping and forgot to bring a tent, so I had to sleep under the stars.",
    "translation": "Jednou jsem šel(a) kempovat a zapomněl(a) jsem přinést stan, takže jsem musel(a) spát pod hvězdami."
  },
  {
    "sentence": "While backpacking in a remote area, I encountered a wild animal, and my only defense was a bag of potato chips.",
    "translation": "Během cestování s batohem v odlehlé oblasti jsem narazil(a) na divoké zvíře, a moje jediná obrana byla pytel brambůrků."
  },
  {
    "sentence": "I once accidentally boarded the wrong flight and didn't realize it until the plane took off.",
    "translation": "Jednou jsem omylem nastoupil(a) na špatný let a uvědomil(a) jsem si to až, když letadlo vzlétlo."
  },
  {
    "sentence": "During a hiking trip, I encountered a mysterious cave and decided to explore it without any equipment.",
    "translation": "Během výletu na pěší túře jsem narazil(a) na tajemnou jeskyni a rozhodl(a) jsem se ji prozkoumat bez jakéhokoli vybavení."
  },
  {
    "sentence": "I participated in a local dance competition and won, even though I had never taken a dance lesson before.",
    "translation": "Zúčastnil(a) jsem se místní taneční soutěže a vyhrál(a), i když jsem nikdy předtím nedostal(a) lekce tance."
  },
  {
    "sentence": "While in a foreign country, I accidentally insulted someone by using a gesture that was considered rude there.",
    "translation": "Když jsem byl(a) v cizí zemi, omylem jsem urazil(a) někoho použitím gesta, které bylo považováno za hrubé."
  },
  {
    "sentence": "I once took a spontaneous road trip and ended up in a town where they were filming a movie.",
    "translation": "Jednou jsem podnikl(a) spontánní cestu autem a skončil(a) jsem ve městě, kde natáčeli film."
  },
  {
    "sentence": "I once attended a costume party dressed as a historical figure, and people thought I was a hired actor.",
    "translation": "Jednou jsem se zúčastnil(a) kostýmované party oblečený(a) jako historická postava, a lidé si mysleli, že jsem najatý herec."
  },
  {
    "sentence": "During a cooking class, I accidentally mistook salt for sugar and created a dessert that nobody could eat.",
    "translation": "Během vaření jsem omylem zaměnil(a) sůl za cukr a vytvořil(a) jsem dezert, který nikdo nemohl sníst."
  },
  {
    "sentence": "I once tried to impress someone by speaking a language I didn't actually know, and it didn't end well.",
    "translation": "Jednou jsem se snažil(a) někoho zaujmout tím, že jsem mluvil(a) jazykem, který ve skutečnosti neznám, a to nedopadlo dobře."
  },
  {
    "sentence": "During a karaoke night, I sang the wrong lyrics to a popular song, and the audience burst into laughter.",
    "translation": "Během karaoke večera jsem zpíval(a) špatné texty k oblíbené písni a publikum se rozchechtalo."
  },
  {
    "sentence": "I once joined a dance class to overcome my fear of dancing in public, and now I love it.",
    "translation": "Jednou jsem se připojil(a) k tanečnímu kurzu, abych překonal(a) strach z tance veřejnosti, a teď to miluji."
  },
  {
    "sentence": "I once went to a job interview and accidentally called the interviewer by the wrong name, but still got the job.",
    "translation": "Jednou jsem šel(a) na pohovor do práce a omylem jsem oslovoval(a) interviewera špatným jménem, ale přesto jsem dostal(a) práci."
  },
  {
    "sentence": "During a family dinner, I tried to impress everyone by cooking a fancy dish, but it ended up in a kitchen disaster.",
    "translation": "Během rodinné večeře jsem se snažil(a) udělat dojem na všechny tím, že jsem vařil(a) něco vyhlášeného, ale skončilo to katastrofou v kuchyni."
  },
  {
    "sentence": "I once accidentally sent a text complaining about my boss to my boss instead of a friend.",
    "translation": "Jednou jsem omylem poslal(a) text s stížností na svého šéfa právě jemu místo příteli."
  },
  {
    "sentence": "During a public speech, I forgot my lines and had to improvise, and surprisingly, it turned out better than rehearsed.",
    "translation": "Během veřejného projevu jsem zapomněl(a) své řečnické pasáže a musel(a) jsem improvizovat, a překvapivě to dopadlo lépe než při zkoušce."
  },
  {
    "sentence": "I once tried a new recipe for a dinner date, and it turned into a smoke-filled kitchen and a pizza delivery night.",
    "translation": "Jednou jsem zkusil(a) nový recept na večeři na rande, a skončilo to kouřem naplněnou kuchyní a večerem s pizzovým donáškou."
  }]