[
  {
    "sentence": "When I am in a hostel, I always wear flip-flops to go shower.",
    "translation": "Když jsme v hostelu, do sprchy vždy nosím žabky"
  },

   {
    "sentence": "During winter, I prefer warm destinations to escape the cold.",
    "translation": "V zimě preferuji teplá místa k úniku před chladem."
  },
  {
    "sentence": "In winter, I enjoy tropical travel for sun and culture.",
    "translation": "V zimě si užívám tropická putování kvůli slunci a kultuře."
  },
  {
    "sentence": "In colder months, I explore sunny places and try local cuisines.",
    "translation": "V chladnějších měsících zkoumám slunečná místa a ochutnávám místní kuchyni."
  },
  {
    "sentence": "In winter, I trade snow for sandy beaches and water activities.",
    "translation": "V zimě měním sníh za písečné pláže a vodní aktivity."
  },
  {
    "sentence": "During winter holidays, I escape to mild climates, explore history, and enjoy cozy cafés.",
    "translation": "Během zimních prázdnin uteču do mírného klimatu, objevuji historii a užívám si útulných kaváren."
  },
  {
    "sentence": "I once tried bungee jumping but chickened out at the last moment.",
    "translation": "Jednou jsem vyzkoušel(a) bungee jumping, ale v poslední chvíli jsem se zalekl(a)."
  },
  {
    "sentence": "During a hiking trip, I accidentally walked into a film set thinking it was a real village.",
    "translation": "Během výletu na pěší túře jsem omylem vkročil(a) na filmové natáčení, myslel(a) jsem si, že je to skutečná vesnice."
  },{
    "sentence": "I once won a dance competition dressed as a disco ball.",
    "translation": "Jednou jsem vyhrál(a) taneční soutěž oblečený(a) jako diskokoule."
  },{
    "sentence": "During a language exchange, I accidentally told a funny story in a serious tone, leading to confusion.",
    "translation": "Během jazykové výměny jsem omylem vyprávěl(a) vtipný příběh vážným tónem, což způsobilo zmatek."
  },{
    "sentence": "I once organized a surprise party for a friend, but they found out beforehand and surprised me instead.",
    "translation": "Jednou jsem připravil(a) překvapení na oslavu pro přítele, ale oni to předem zjistili a překvapili spíše mě."
  },{
    "sentence": "I once participated in a karaoke competition and sang a song in a language I didn't understand.",
    "translation": "Jednou jsem se zúčastnil(a) karaoke soutěže a zpíval(a) píseň v jazyce, který jsem nerozuměl(a)."
  },
  {
    "sentence": "During a camping trip, I accidentally set up my tent in an area frequented by friendly raccoons.",
    "translation": "Během kempování jsem omylem postavil(a) stan na místě, které často navštěvují přátelští jezevci."
  },
  {
    "sentence": "I once mistook a stranger for a friend and struck up a conversation, only to realize my error later.",
    "translation": "Jednou jsem omylem považoval(a) cizince za přítele a začal(a) jsem s ním rozhovor, až později jsem si uvědomil(a) svůj omyl."
  },
  {
    "sentence": "During a road trip, I took a detour to visit a famous landmark and got lost for hours.",
    "translation": "Během cestování autem jsem udělal(a) odbočku, abych navštívil(a) slavnou památku, a ztratil(a) jsem se na několik hodin."
  },
  {
    "sentence": "I once tried to impress someone by cooking a gourmet meal and ended up ordering takeout.",
    "translation": "Jednou jsem se snažil(a) někoho zaujmout tím, že jsem vařil(a) gourmet jídlo, a skončil(a) jsem objednávkou s sebou."
  },{
    "sentence": "During a language exchange, I accidentally used a slang word thinking it was a common expression, causing laughter and confusion.",
    "translation": "Během jazykové výměny jsem omylem použil(a) slangové slovo, myslel(a) jsem si, že je to běžný výraz, což způsobilo smích a zmatek."
  },
  {
    "sentence": "I once went on a spontaneous road trip and ended up in a charming town with no plan but had an unforgettable time.",
    "translation": "Jednou jsem se vydal(a) na spontánní cestu autem a skončil(a) jsem v malebném městě bez plánu, ale prožil(a) jsem nezapomenutelný čas."
  },
  {
    "sentence": "I accidentally sent a text meant for my friend to my boss, and it contained embarrassing emojis.",
    "translation": "Omylem jsem poslal(a) text, který byl určený pro mého přítele, svému šéfovi, a obsahoval trapné emotikony."
  },
  {
    "sentence": "During a hiking trip, I encountered a rare species of bird and spent hours trying to capture the perfect photo.",
    "translation": "Během výletu na pěší túře jsem narazil(a) na vzácný druh ptáka a strávil(a) jsem hodiny snažením se zachytit dokonalou fotku."
  },
  {
    "sentence": "I once attended a costume party dressed as a character from a popular TV show and accidentally won the costume contest.",
    "translation": "Jednou jsem se zúčastnil(a) kostýmované party oblečený(a) jako postava z populární televizní show a omylem jsem vyhrál(a) soutěž o nejlepší kostým."
  }
  
  
      
]
